window.QIANLI_GALLERY_RECORDS = {
  "2023": [
    {
      "title": "英雄机器人",
      "record": "【简介】其实这台车是22赛季流传下来的，傅佳键在上交Bad Boy的基础上开创性地加入了丝杆pitch，这也是在RM比赛历史中丝杆pitch轴的首秀。23赛季中进行了维护和改造工作，精简了它的功能。\n【机械结构】张欣 傅佳键（顾问）",
      "legacy": "继承迭代"
    },
    {
      "title": "工程机器人",
      "record": "【简介】\n【机械结构】余志翔\n【电控实现】何浩\n【视觉算法】无",
      "legacy": "全新打造"
    },
    {
      "title": "3号步兵机器人",
      "record": "【简介】这是一台基于上交构型改造的上供弹步兵，陆擎战队支援了其机械结构的设计。\n【机械结构】王浚西\n【电控实现】刘昊\n【视觉算法】郑谦益",
      "legacy": "嗟来之食"
    },
    {
      "title": "4号步兵机器人",
      "record": "【简介】花活很多的全向轮步兵，开创性地采用了扭转同步带驱动方式，pitch电机置于yaw轴下，降低整体重心；轮组电机置于簧上，通过两级传动进行动力传输，极大减小了簧下质量。但由于机械稳定性问题，在赛场上未能取得较好的战果，但其云台设计在社区广受赞誉。\n【机械结构】伍宇杰 全锐\n【电控实现】伍宇杰\n【视觉算法】郑谦益",
      "legacy": "全新打造"
    },
    {
      "title": "5号步兵机器人",
      "record": "【简介】其实这台车是22赛季流传下来的，由李兵和汪沛宇进行设计制作，是队内第一台中供步兵。在23年进行维护被保留下来，成为了电控队员喜爱的调试平台。被装上了像棺材一样的方形保护壳。\n【机械结构】杨鑫垚\n【电控实现】张杰轩\n【视觉算法】刘昕瑶",
      "legacy": "继承保留"
    },
    {
      "title": "哨兵机器人",
      "record": "【简介】战队首台自动步兵，采用单云台双发射设计，供弹拨盘分置于顶部和底盘\n【机械结构】罗定凌 吴奕林\n【电控实现】张智奎\n【视觉算法】刘昕瑶",
      "legacy": "全新打造"
    },
    {
      "title": "飞镖机器人",
      "record": "【简介】队史首台飞镖机器人，基于多级摩擦轮发射机构。由于镖体设计缺陷，在赛场上未取得较好发挥\n【机械结构】余志翔\n【电控实现】杨艺哲",
      "legacy": "继承保留"
    },
    {
      "title": "空中机器人",
      "record": "【简介】往届赛季圣遗物中攒出的拼好机，但为后续赛季无人机组的发展奠定了重要的技术基础。\n【机械结构】李页丹\n【电控实现】杜承毅",
      "legacy": "全新打造"
    }
  ],
  "2024": [
    {
      "title": "双摩擦英雄【联盟赛】",
      "record": "【简介】其实这台车是22赛季流传下来的，傅佳键在上交Bad Boy的基础上开创性地加入了丝杆pitch，这也是在RM比赛历史中丝杆pitch轴的首秀。但是经过23赛季精简了它的功能，不过好像关键性能变得更差了。\n【服役周期】2022年~2024年5月\n\n【机械结构】傅佳键 洪瑞珑\n【电控实现】倪瑞辉",
      "legacy": "继承保留"
    },
    {
      "title": "贰點伍摩擦英雄【分区赛】",
      "record": "【简介】这台车是队史首台拥有自适应悬挂的机器人，同时应用了云台重力补偿。发射系统通过一个小摩擦轮进行主动预置位，同时拥有一个俯仰小云台便于吊射（后来发现吊射精度不足）。\n【服役周期】2024年4月~2024年8月\n\n【机械结构】洪瑞珑 汪沛宇\n【电控实现】倪瑞辉",
      "legacy": "全新打造"
    },
    {
      "title": "三摩擦英雄【复活赛】",
      "record": "【简介】回归队伍特色丝杆pitch设计，并为可能的飞坡场景设计了丝杆缓冲机构。首次应用了三摩擦发射机构，使其成为队史以来第一台真正意义上的吊射英雄。\n【服役周期】2024年7月至今\n\n【机械结构】汪沛宇 洪瑞珑\n【电控实现】倪瑞辉 \n【视觉算法】王琦",
      "legacy": "全新打造"
    },
    {
      "title": "工程机器人",
      "record": "【简介】一款基于升降SCARA机械臂的工程机器人，拥有一个带传送带的储矿仓，末端执行器为涵道风机。在这台机器人上第一次尝试了视觉兑换矿石的功能，可以实现低级别矿石的自动兑换。\n【服役周期】2024年4月至今\n\n【机械结构】全锐 傅佳键（顾问）\n【电控实现】李振兴 何浩（顾问）\n【视觉算法】张欣",
      "legacy": "全新打造"
    },
    {
      "title": "麦轮步兵",
      "record": "【简介】其实这台车是22赛季流传下来的，由李兵和汪沛宇进行设计制作，是队内第一台中供步兵。在23年进行维护被保留下来，成为了电控队员喜爱的调试平台。在24赛季进行了发射系统的改造，将原先散步较大的纵置摩擦轮发射系统改造成了横置摩擦轮发射系统。24赛季作为备车服役，退役后云台被拆除，底盘在25赛季被改造成原型小车，成为导航组的调试平台。\n【服役周期】2022年~2024年5月\n\n【机械结构】符兴毅\n【电控实现】闭凯翔",
      "legacy": "继承迭代"
    },
    {
      "title": "全向轮步兵",
      "record": "【简介】基于23赛季的全向机器人进行迭代，去除了复杂度更高造成稳定性较差的创新性机构，恢复其简洁性，提高其在赛场上的稳定性。\n【服役周期】2022年12月~2024年5月\n\n【机械结构】吕沐城 伍宇杰（顾问）\n【电控实现】闭凯翔\n【视觉算法】郑元斌 郑谦益 刘昕瑶（顾问）",
      "legacy": "继承迭代"
    },
    {
      "title": "初代舵轮步兵【联盟赛】",
      "record": "【简介】千里战队的第一台舵轮构型步兵，摒弃了传统的铝方框架，采用碳管和碳板车架，搭配了23赛季研发的上供弹云台。但是由于悬挂系统的设计缺陷导致悬挂失效，被戏称为“体育生”，但是对于联盟赛来说是一个不错的选择，也成为了联盟赛冠军的功臣。\n【服役周期】2023年12月~2025年3月\n\n【机械结构】伍宇杰（顾问）\n【电控实现】刘昊",
      "legacy": "全新打造"
    },
    {
      "title": "舵轮步兵【分区赛】",
      "record": "【简介】基于初代舵轮步兵机器人的工作，结合了杰哥在22赛季的舵下瓦特连杆构型悬挂的设计，重新设计了一版拥有有效悬挂系统的舵轮构型机器人，以适应对抗赛的地形需求；同时创新性地进行了一体化衍生式设计云台架的研发尝试。\n【服役周期】2024年4月~2025年5月\n\n【机械结构】何煦 覃宇铭 汪沛宇 伍宇杰（顾问）\n【电控实现】刘昊\n【视觉算法】郑元斌",
      "legacy": "全新打造"
    },
    {
      "title": "白舵轮步兵【复活赛】",
      "record": "【简介】黑舵轮的双胞胎兄弟，采用了改动后的上交开源中供云台以及舵上的线轨悬挂，体积极小可以轻松通过隧洞，但是轻量化和轮毂胎皮的尝试较为失败，导致在全向运动时消耗功率大大上升，也很难进行飞坡。\n【服役周期】2024年7月~2025年3月\n\n【机械结构】何煦 符兴毅 吕沐城\n【电控实现】闭凯翔\n【视觉算法】郑元斌",
      "legacy": "全新打造"
    },
    {
      "title": "黑舵轮步兵【复活赛】",
      "record": "【简介】白舵轮的双胞胎兄弟，采用了改动后的上交开源中供云台以及舵上的线轨悬挂，体积极小可以轻松通过隧洞，但是轻量化和轮毂胎皮的尝试较为失败，导致在全向运动时消耗功率大大上升，也很难进行飞坡。\n【服役周期】2024年7月~2025年1月\n\n【机械结构】何煦 符兴毅 吕沐城\n【电控实现】倪瑞辉\n【视觉算法】郑元斌",
      "legacy": "全新打造"
    },
    {
      "title": "初代平衡步兵【复活赛】",
      "record": "【简介】队史首台完整的轮腿平衡步兵，24赛季重要的技术积累之一，在复活赛前一个月赶制而成，采用了改动后的上交开源中供云台和基于宇树A1髋关节电机的轮腿底盘。\n【服役周期】2024年7月~2024年12月\n\n【机械结构】覃宇铭\n【电控实现】刘昊\n【视觉算法】郑元斌",
      "legacy": "全新打造"
    },
    {
      "title": "空中机器人",
      "record": "【简介】一款超重的，没有自瞄的，飞行较大程度上依赖于飞手操控技术的无人机；搭配了基于23赛季步兵发射魔改的发射系统，稳定性堪忧。\n【服役周期】2024年5月~2025年3月\n\n【机械结构】张博洋 李页丹 洪瑞珑\n【电控实现】李铸铭",
      "legacy": "继承迭代"
    },
    {
      "title": "双头哨兵机器人",
      "record": "【简介】队史首台在比赛中自主攻击和防御的地面烧饼，双头三云台，独立供弹，分别被昵称为“潇洒哥”和“黑大帅”，多次对敌方地面和建筑进行火力压制。\n【服役周期】2024年3月~2025年3月\n\n【机械结构】吴奕林 粟宇 韦许韬\n【电控实现】罗亚琪\n【视觉算法】郑元斌 \n【导航决策】陈瀚 叶林竑",
      "legacy": "全新打造"
    },
    {
      "title": "飞镖机器人",
      "record": "【简介】队史首台具备实战意义且在比赛中实现前哨靶命中的飞镖机器人，通过两个大尺寸大惯量摩擦轮进行发射，采用三角形闭合框架提高机体刚性，通过丝杆实现yaw轴导向。由于初版超重，去除了pitch轴的驱动和传动，并做了很多轻量化工作。\n【服役周期】2024年1月~2025年5月\n\n【机械结构】李晨弘 汪沛宇 张博洋 郭丁赫\n【电控实现】江晨曦 张杰轩（顾问）",
      "legacy": "全新打造"
    },
    {
      "title": "雷达机器人",
      "record": "【简介】队史第一台真正意义上的雷达机器人，使用队内原用于画图/挖矿/打守望先锋的台式机作为算力平台，精确度优秀，在比赛中多次发动全场易伤。\n【服役周期】2023年至今\n\n【视觉算法】郑元斌",
      "legacy": "继承迭代"
    }
  ],
  "2025": [
    {
      "title": "三摩擦英雄机器人",
      "record": "【简介】这台吊射英雄在25赛季突然又打不准了。但是沛沛最后力挽狂澜，将其恢复到了当初九成功力，成功地在对抗赛实现了两局10发部署命中，但是落后的设计使其距25赛季平均吊射水平依然有相当的差距。\n【服役周期】2024年7月至今\n\n【机械结构】汪沛宇 洪瑞珑\n【电控实现】彭少雷 张瀚予 倪瑞辉\n【视觉算法】冯亦珂",
      "legacy": "继承迭代"
    },
    {
      "title": "工程机器人",
      "record": "【简介】基于24赛季流传下来的机器人进行了部分迭代升级，更换末端执行器为真空吸盘，更改了末三轴的结构进行适配。搭配了全新的等比缩放机械臂自定义控制器进行操作。\n【服役周期】2024年4月至今\n\n【机械结构】全锐 江晨曦\n【电控实现】严海轩",
      "legacy": "继承迭代"
    },
    {
      "title": "串联腿步兵",
      "record": "【简介】千里队史第一台串联腿步兵机器人，基于上海交通大学与24赛季应用的构型进行设计。可以实现翻倒自救，轻松上台阶等功能，飞坡稳定性极佳，是目前队内机动性和通过性最好的机器人。\n【服役周期】2025年5月至今\n\n【机械结构】覃宇铭 王巍澄 汪沛宇\n【电控实现】李振兴\n【视觉算法】冯亦珂",
      "legacy": "全新打造"
    },
    {
      "title": "并联腿步兵",
      "record": "【简介】千里队史第二台并联腿步兵机器人，基于前一代设计的优缺点以及后续经验进行设计。主要设计改变有：缩小轮间距，改为下供弹，使得该代并联腿机器人更轻更灵活，以及更大的载弹量。\n【服役周期】2025年2月至今\n\n【机械结构】覃宇铭 王巍澄\n【电控实现】李振兴\n【视觉算法】冯亦珂",
      "legacy": "全新打造"
    },
    {
      "title": "全向轮步兵",
      "record": "【简介】由于前一个赛季留存的舵轮步兵维护不善，需要一台稳定的过洞步兵，因此有了这台由哨兵紧急修改而来的全向轮步兵。但是俯角不够、容易卡弹丸\n【服役周期】2025年4月至今\n\n【机械结构】粟宇\n【电控实现】洪竞权\n【视觉算法】刘瑶瑶",
      "legacy": "全新打造"
    },
    {
      "title": "空中机器人",
      "record": "【简介】队史首台搭载自瞄系统的无人机，采用中心供弹与鹅颈云台，相较上赛季减重明显。虽然命运多舛，但也能够在有限的未出故障的局次中打出不俗的爆发伤害。\n【服役周期】2025年5月至今\n\n【机械结构】张天煦 谭虹利 郝骏锋 洪瑞珑\n【电控实现】莫湘渝\n【视觉算法】郑元斌",
      "legacy": "全新打造"
    },
    {
      "title": "哨兵",
      "record": "【简介】能过狗洞的全向轮哨兵。结构紧凑，机动灵活，首次拥有了较为完善的导航决策能力。\n【服役周期】2025年2月至今\n\n【机械结构】粟宇\n【电控实现】李振兴\n【视觉算法】郑元斌\n【导航决策】李嘉昊",
      "legacy": "全新打造"
    },
    {
      "title": "摩擦轮飞镖",
      "record": "【简介】24赛季流传下来的飞镖机器人，增加了镖架制导的功能，对原先结构的重量冗余进行了适当删减。\n【服役周期】2024年1月~2025年5月\n\n【机械结构】郭丁赫 李晨弘\n【电控实现】郑皓文 张瀚予\n【视觉算法】张珂玮",
      "legacy": "继承迭代"
    },
    {
      "title": "雷达机器人",
      "record": "【简介】在24赛季的雷达的基础上优化了外设与算法，便于运输。但是由于通信的问题导致没有像上一个赛季一样发挥出关键作用。\n【服役周期】2023年至今\n\n【视觉算法】郑元斌",
      "legacy": "继承迭代"
    }
  ]
};
